templates/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="127.0.0.1" port="{{port}}" type="tcp"/>
  </servers>

  <monitoring>
    <monitor host="localhost"/>
  </monitoring>

  <load duration="70" unit="second">
    
    <arrivalphase phase="1" duration="5" unit="second">
      <users maxnumber="0" interarrival="1" unit="minute"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="25" unit="second">
      <session_setup name="{{sql}}-workload-fill" probability="100"/>
      <session_setup name="{{sql}}-workload-test" probability="0"/>
      <users interarrival="3" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="30" unit="second">
      <session_setup name="{{sql}}-workload-fill" probability="0"/>
      <session_setup name="{{sql}}-workload-test" probability="100"/>
      <users interarrival="3" unit="second"></users>
    </arrivalphase>

    <user session="{{sql}}-create-schema" start_time="0" unit="minute"></user>
    <user session="{{sql}}-migrate-schema" start_time="40" unit="second"></user>
    <user session="{{sql}}-drop-schema" start_time="69" unit="second"></user>
  </load>

  <sessions>

    <session probability="0" name="{{sql}}-create-schema" type="ts_{{sql}}">
      <request>
        <{{sql}} type="connect" database="{{database}}" username="{{user}}" />
      </request>
      <request>
        <{{sql}} type="authenticate" database="{{database}}" username="{{user}}" password="{{password}}" />
      </request>
      <request>
        <{{sql}} type="sql">CREATE DATABASE test</{{sql}}>
      </request>
      <request>
        <{{sql}} type="close"></{{sql}}>
      </request>
      <request>
        <{{sql}} type="connect" database="test" username="{{user}}" />
      </request>
      <request>
        <{{sql}} type="authenticate" database="test" username="{{user}}" password="{{password}}" />
      </request>
      {% for statement in schema %}
      <request>
        <{{sql}} type="sql">{{ statement }}</{{sql}}>
      </request>
      {% endfor %}
      <request>
        <{{sql}} type="close"></{{sql}}>
      </request>
    </session>

    <session probability="0" name="{{sql}}-migrate-schema" type="ts_{{sql}}">
      <request>
        <{{sql}} type="connect" database="test" username="{{user}}" />
      </request>
      <request>
        <{{sql}} type="authenticate" database="test" username="{{user}}" password="{{password}}" />
      </request>
      {% for statement in migration %}
      <request>
        <{{sql}} type="sql">{{ statement }}</{{sql}}>
      </request>
      {% endfor %}
      <request>
        <{{sql}} type="close"></{{sql}}>
      </request>
    </session>

    <session probability="0" name="{{sql}}-drop-schema" type="ts_{{sql}}">
      <request>
        <{{sql}} type="connect" database="{{database}}" username="{{user}}" />
      </request>
      <request>
        <{{sql}} type="authenticate" database="{{database}}" username="{{user}}" password="{{password}}" />
      </request>
      <request>
        <{{sql}} type="sql">DROP DATABASE test</{{sql}}>
      </request>
      <request>
        <{{sql}} type="close"></{{sql}}>
      </request>
    </session>

    <session probability="50" name="{{sql}}-workload-fill" type="ts_{{sql}}">
      <request>
        <{{sql}} type="connect" database="test" username="{{user}}" />
      </request>
      <request>
        <{{sql}} type="authenticate" database="test" username="{{user}}" password="{{password}}" />
      </request>
      {% for statement in workload_fill %}
      <request>
        <{{sql}} type="sql">{{ statement }}</{{sql}}>
      </request>
      {% endfor %}
      <request>
        <{{sql}} type="close"></{{sql}}>
      </request>
  </session>

    <session probability="50" name="{{sql}}-workload-test" type="ts_{{sql}}">
      <request>
        <{{sql}} type="connect" database="test" username="{{user}}" />
      </request>
      <request>
        <{{sql}} type="authenticate" database="test" username="{{user}}" password="{{password}}" />
      </request>
      {% for statement in workload_test %}
      <request>
        <{{sql}} type="sql">{{ statement }}</{{sql}}>
      </request>
      {% endfor %}
      <request>
        <{{sql}} type="close"></{{sql}}>
      </request>
  </session>
 </sessions>
</tsung>